```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # scaleway_k8s_cluster.trading will be created
  + resource "scaleway_k8s_cluster" "trading" {
      + apiserver_url               = (known after apply)
      + cni                         = "cilium"
      + created_at                  = (known after apply)
      + delete_additional_resources = false
      + id                          = (known after apply)
      + kubeconfig                  = (known after apply)
      + name                        = "trading"
      + organization_id             = (known after apply)
      + project_id                  = (known after apply)
      + region                      = (known after apply)
      + status                      = (known after apply)
      + updated_at                  = (known after apply)
      + upgrade_available           = (known after apply)
      + version                     = "1.18.0"
      + wildcard_dns                = (known after apply)

      + auto_upgrade {
          + enable                        = (known after apply)
          + maintenance_window_day        = (known after apply)
          + maintenance_window_start_hour = (known after apply)
        }

      + autoscaler_config {
          + balance_similar_node_groups      = (known after apply)
          + disable_scale_down               = (known after apply)
          + estimator                        = (known after apply)
          + expander                         = (known after apply)
          + expendable_pods_priority_cutoff  = (known after apply)
          + ignore_daemonsets_utilization    = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_unneeded_time         = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
        }

      + open_id_connect_config {
          + client_id       = (known after apply)
          + groups_claim    = (known after apply)
          + groups_prefix   = (known after apply)
          + issuer_url      = (known after apply)
          + required_claim  = (known after apply)
          + username_claim  = (known after apply)
          + username_prefix = (known after apply)
        }
    }

  # scaleway_k8s_pool.default will be created
  + resource "scaleway_k8s_pool" "default" {
      + autohealing         = false
      + autoscaling         = false
      + cluster_id          = (known after apply)
      + container_runtime   = "containerd"
      + created_at          = (known after apply)
      + current_size        = (known after apply)
      + id                  = (known after apply)
      + max_size            = (known after apply)
      + min_size            = 1
      + name                = "default"
      + node_type           = "DEV1-S"
      + nodes               = (known after apply)
      + region              = (known after apply)
      + size                = 2
      + status              = (known after apply)
      + updated_at          = (known after apply)
      + version             = (known after apply)
      + wait_for_pool_ready = false
      + zone                = (known after apply)

      + upgrade_policy {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # scaleway_object_bucket.test_bucket will be created
  + resource "scaleway_object_bucket" "test_bucket" {
      + acl      = "private"
      + endpoint = (known after apply)
      + id       = (known after apply)
      + name     = "testbucket"
      + region   = (known after apply)
      + tags     = {
          + "key" = "value"
        }

      + versioning {
          + enabled = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```